Documents/бит_Предупреждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_Предупреждение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПредупрежденияЖильцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма с учетом переплат. Фактическая сумма долга. Без пени.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезПереплат</Name>
							<Comment>Сумма без учета переплат по услугам в разрезе ЛС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Comment>Сумма начисленной пени</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/бит_СтатусыИсходящегоЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусыИсходящегоЭлектронногоПисьма</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыТекстовЭлектронныхПисем</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСоответствийИменВложенийИдентификаторам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФайлаДляHTML</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_Предупреждение/Forms/ФормаРассылки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Предупреждение о долге за коммунальные услуги.";
	
	ТаблицаПисем.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.Ссылка);
	ДокВладелец = Параметры.Ссылка;
	
	УчетнаяЗапись            = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	ОтправительПредставление = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьПредставлениеДляУчетнойЗаписи(УчетнаяЗапись);
	
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.MXL , "mxl");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.HTML, "html");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.XLS , "xls");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.PDF , "pdf");
	Элементы.ТипФайла.СписокВыбора.Добавить(ТипФайлаТабличногоДокумента.ODS , "ods");
	ТипФайла = ТипФайлаТабличногоДокумента.XLS;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПисьма(Команда)
	
	СоздатьПисьмаСервер(ДокВладелец);
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсе(Команда)
	
	СтатусПисьма = ПредопределенноеЗначение("Перечисление.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее");
	ОтправитьПисьма(СтатусПисьма);
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеСейчас(Команда)
	
	СтатусПисьма = ПредопределенноеЗначение("Перечисление.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено");
	ОчиститьСообщения();
	ОтправитьПисьма(СтатусПисьма);
	Элементы.ТаблицаПисем.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПисем(Команда)
	
	Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗдания(Команда)
	
	СписокЗданий.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	
	СписокЛС.Очистить();
	СписокЗданий.Очистить();
	СписокУлиц.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУлицы(Команда)
	
	СписокУлиц.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛC(Команда)
	
	СписокЛС.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура СоздатьПисьмаСервер(ДокВладелец)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПредупреждениеЛицевыеСчета.ОтветственноеЛицо КАК ПолучательПисьма,
	|	бит_ПредупреждениеЛицевыеСчета.Сумма КАК Сумма,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаБезПереплат КАК СуммаБезПереплат,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаПени КАК СуммаПени,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета,
	|	бит_Предупреждение.МоментРасчета КАК МоментРасчета,
	|	бит_Предупреждение.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ВсеЛС
	|ИЗ
	|	Документ.бит_Предупреждение.ЛицевыеСчета КАК бит_ПредупреждениеЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_Предупреждение КАК бит_Предупреждение
	|		ПО бит_ПредупреждениеЛицевыеСчета.Ссылка = бит_Предупреждение.Ссылка
	|ГДЕ
	|	бит_ПредупреждениеЛицевыеСчета.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПолучательПисьма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка КАК ПолучательПисьма,
	|	бит_ПроживающиеКонтактнаяИнформация.Представление КАК АдресПочты
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеЛС.ПолучательПисьма
	|			ИЗ
	|				ВТ_ВсеЛС)
	|	И бит_ПроживающиеКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И бит_ПроживающиеКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПроживающего)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПолучательПисьма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ВсеЛС.ПолучательПисьма КАК ПолучательПисьма,
	|	ВТ_ВсеЛС.Сумма КАК Сумма,
	|	ВТ_ВсеЛС.СуммаБезПереплат КАК СуммаБезПереплат,
	|	ВТ_ВсеЛС.СуммаПени КАК СуммаПени,
	|	ВТ_ВсеЛС.Здание КАК Здание,
	|	ВТ_ВсеЛС.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета,
	|	ВТ_ВсеЛС.МоментРасчета КАК МоментРасчета,
	|	ЕСТЬNULL(ВТ_КонтактнаяИнформация.АдресПочты, """") КАК АдресПочты,
	|	ВТ_ВсеЛС.Дата КАК Дата
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ВТ_КонтактнаяИнформация
	|		ПО ВТ_ВсеЛС.ПолучательПисьма = ВТ_КонтактнаяИнформация.ПолучательПисьма";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Отбор ЛС.
	МассивЛС = СписокЛС.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
	Если МассивЛС.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет В (&ЛицевыеСчета)");
	КонецЕсли;
	
	// Отбор задний.
	МассивЗадний = СписокЗданий.Выгрузить(,"Здание").ВыгрузитьКолонку("Здание");
	Если МассивЗадний.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ПредупреждениеЛицевыеСчета.Здание В (&Здание)");
	КонецЕсли;
	
	// Отбор улиц.
	МассивУлиц = СписокУлиц.Выгрузить(,"Улица").ВыгрузитьКолонку("Улица");
	Если МассивУлиц.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ПредупреждениеЛицевыеСчета.Улица В (&Улица)");
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Ссылка"		, ДокВладелец);
	Запрос.УстановитьПараметр("ЛицевойСчет"	, МассивЛС);
	Запрос.УстановитьПараметр("Здание"		, МассивЗадний);
	Запрос.УстановитьПараметр("Улица"		, МассивУлиц);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент  = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСнизу   = 0;
	
	МассивИсключений  = Новый Массив;
	ШаблонСообщения = ПолучитьСтукрутуШаблонаСообщения(ШаблонТекстаПисьма);
	
	СоответствиеЛС = Документы.бит_Предупреждение.ПодготовитьПредупреждения(ДокВладелец);
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		
		ВремяИзменения  = ТекущаяДатаСеанса();
		Автор           = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		Письмо = Справочники.бит_ЭлектронноеПисьмоИсходящее.СоздатьЭлемент();
		Письмо.ДокументВладелец = ДокВладелец;
		Письмо.Автор			= Автор;
		Письмо.Ответственный	= Автор;
		Письмо.СтатусПисьма		= Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Черновик;
		Письмо.ДатаСоздания		= ВремяИзменения;
		Письмо.Тема				= ТемаПисьма;
		Письмо.ЕстьВложения		= Истина;
		Письмо.ОтправкаКвитанций= Ложь;
		Письмо.Предмет			= Выборка.ЛицевойСчет;
		Письмо.ШаблонИзвещений	= Неопределено;
		Письмо.ПериодКвитанции	= Выборка.МоментРасчета;
		Письмо.Комментарий		= СтрШаблон(НСтр("ru = 'Созданно автоматически из документа ""%1"".'"), ДокВладелец);
		
		
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			
			Письмо.УчетнаяЗапись = УчетнаяЗапись;
			РеквизитыОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись,"Ссылка, ИмяПользователя, АдресЭлектроннойПочты");
			Письмо.ОтправительПредставление = бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьПредставлениеАдресата(
				РеквизитыОтправителя.ИмяПользователя, РеквизитыОтправителя.АдресЭлектроннойПочты, "");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПолучательПисьма) И ЗначениеЗаполнено(Выборка.АдресПочты) Тогда
			
			Письмо.СписокПолучателейПисьма	= Выборка.АдресПочты;
			
			НоваяСтрока			= Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Адрес	= Выборка.АдресПочты;
			НоваяСтрока.Контакт	= Выборка.ПолучательПисьма;
			
		КонецЕсли;
		
		Если ОставлятьПисьмаНаСервере Тогда
			
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Адрес = РеквизитыОтправителя.АдресЭлектроннойПочты;
			
		КонецЕсли; 
		
		Попытка
			
			Письмо.Записать();
			
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат;
			
		КонецПопытки;
		
		ТабличнйДокумент = СоответствиеЛС[Выборка.ЛицевойСчет];
		Если НЕ ТабличнйДокумент = Неопределено Тогда
			
			РазрешениеФайла = НРег(Строка(ТипФайла));
			Если ЗапаковатьZIP Тогда
				РазрешениеФайла = НРег("ZIP");
			КонецЕсли; 
			
			ИмяФайла = "Предупреждение (" + Формат(Выборка.Дата,"ДФ='ММММ гггг'") +"_"+ Письмо.Предмет + ")";
			
			АдресФайлаВоВременномХранилище = ДобавитьПрикрепленныйФайл(ТабличнйДокумент, ИмяФайла, ТипФайла);
			
			бит_ПрисоединенныеФайлыСервер.ДобавитьФайл(Письмо.Ссылка,
			ИмяФайла,
			РазрешениеФайла,
			ВремяИзменения,
			ВремяИзменения,
			АдресФайлаВоВременномХранилище);
		КонецЕсли;
		
		ДобавитьТекстШаблонаСообщения(Письмо.Ссылка, ШаблонСообщения);
		
	КонецЦикла; 
	
	ЗафиксироватьТранзакцию();
	//
	//Элементы.ТаблицаПисем.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура получает структуру шаблона сообщения.
//
Функция ПолучитьСтукрутуШаблонаСообщения(ШаблонТекстаПисьма)
	
	СтруктураШаблонаСообщения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ШаблонТекстаПисьма);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныСообщений.Текст,
	|	бит_ШаблоныСообщений.ТекстHTML,
	|	бит_ШаблоныСообщений.ТипТекста,
	|	бит_ШаблоныСообщений.Кодировка,
	|	бит_ШаблоныСообщений.ТаблицаСоответствийИменВложенийИдентификаторам.(
	|		ИмяФайла,
	|		ИдентификаторФайлаДляHTML,
	|		Картинка
	|	) КАК ТаблицаСоответствийИменВложений
	|ИЗ
	|	Справочник.бит_ШаблоныСообщений КАК бит_ШаблоныСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныСообщений.ТаблицаСоответствийИменВложенийИдентификаторам КАК бит_ШаблоныСообщенийТаблицаСоответствийИменВложенийИдентификаторам
	|		ПО бит_ШаблоныСообщений.Ссылка = бит_ШаблоныСообщенийТаблицаСоответствийИменВложенийИдентификаторам.Ссылка
	|ГДЕ
	|	бит_ШаблоныСообщений.Ссылка = &Ссылка
	|	И НЕ бит_ШаблоныСообщений.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураШаблонаСообщения = Новый Структура("Текст,ТекстHTML,ТипТекста,Кодировка, ТаблицаВложений");
		ЗаполнитьЗначенияСвойств(СтруктураШаблонаСообщения,Выборка);
		
		ТаблицаВложений = Новый Массив;
		
		ВыборкаВложений = Выборка.ТаблицаСоответствийИменВложений.Выбрать();
		
		Пока ВыборкаВложений.Следующий() Цикл
			
			СтруктураСтроки = Новый Структура("ИмяФайла,ИдентификаторФайлаДляHTML,Картинка");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаВложений);
			ТаблицаВложений.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		СтруктураШаблонаСообщения.ТаблицаВложений = ТаблицаВложений;
		
	КонецЕсли; 
	
	Возврат СтруктураШаблонаСообщения;
	
Конецфункции 

&НаСервере
// Процедура добавляет текст шаблона сообщения.
//
Процедура ДобавитьТекстШаблонаСообщения(Письмо, Знач ШаблонСообщения)
	
	Если ШаблонСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ШаблонСообщения.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.HTML И ШаблонСообщения.ТекстHTML = "" Тогда
		Возврат;
		
	КонецЕсли;
	
	ОбъектПисьмо = Письмо.ПолучитьОбъект();
	
	ОбъектПисьмо.Текст     = ШаблонСообщения.Текст;
	ОбъектПисьмо.ТекстHTML = ШаблонСообщения.ТекстHTML;
	ОбъектПисьмо.ТипТекста = ШаблонСообщения.ТипТекста;
	ОбъектПисьмо.Кодировка = ШаблонСообщения.Кодировка;
	
	ОбъектПисьмо.Записать();
	
	Если ШаблонСообщения.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.HTML Тогда
		
		Для каждого Вложение Из ШаблонСообщения.ТаблицаВложений Цикл
			
			ДвоичныеДанныеКартинки = Вложение.Картинка.Получить();
			АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
			ПрисоединенныйФайл = бит_УправлениеЭлектроннойПочтойСервер.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
			Письмо,
			АдресКартинкиВоВременномХранилище,
			"_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_"),
			ДвоичныеДанныеКартинки.Размер());
			
			Если ПрисоединенныйФайл <> Неопределено Тогда
				ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.ИдентификаторФайлаДляHTML;
				ПрисоединенныйФайлОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьма(НовыйСтатусПисьма)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ЭлектронноеПисьмоИсходящее.Ссылка КАК ЭлектронноеПисьмо,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет КАК ЛицевойСчет,
	|	бит_ЭлектронноеПисьмоИсходящее.СтатусПисьма КАК СтатусПисьма,
	|	бит_ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма КАК СписокПолучателейПисьма,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание КАК Здание,
	|	бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание.Улица КАК Улица
	|ИЗ
	|	Справочник.бит_ЭлектронноеПисьмоИсходящее КАК бит_ЭлектронноеПисьмоИсходящее
	|ГДЕ
	|	бит_ЭлектронноеПисьмоИсходящее.ОтправкаКвитанций = ЛОЖЬ
	|	И бит_ЭлектронноеПисьмоИсходящее.Предмет ССЫЛКА Справочник.бит_ЛицевыеСчета
	|	И бит_ЭлектронноеПисьмоИсходящее.ДокументВладелец В(&Ссылка)
	|	И НЕ бит_ЭлектронноеПисьмоИсходящее.ПометкаУдаления
	|	И бит_ЭлектронноеПисьмоИсходящее.СтатусПисьма <> ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|	И бит_ЭлектронноеПисьмоИсходящее.СтатусПисьма <> &НовыйСтатусПисьма";

	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Отбор ЛС.
	МассивЛС = СписокЛС.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
	Если МассивЛС.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ЭлектронноеПисьмоИсходящее.Предмет В (&ЛицевойСчет)");
	КонецЕсли;
	
	// Отбор задний.
	МассивЗадний = СписокЗданий.Выгрузить(,"Здание").ВыгрузитьКолонку("Здание");
	Если МассивЗадний.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание В (&Здание)");
	КонецЕсли;
	
	// Отбор улиц.
	МассивУлиц = СписокУлиц.Выгрузить(,"Улица").ВыгрузитьКолонку("Улица");
	Если МассивУлиц.Количество() > 0 Тогда
		ЗапросСхемы0	= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора0 = ЗапросСхемы0.Операторы[0];
		ОператорВыбора0.Отбор.Добавить("бит_ЭлектронноеПисьмоИсходящее.Предмет.Здание.Улица В (&Улица)");
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Ссылка"				, ДокВладелец);
	Запрос.УстановитьПараметр("НовыйСтатусПисьма"	, НовыйСтатусПисьма);
	Запрос.УстановитьПараметр("ЛицевойСчет"			, МассивЛС);
	Запрос.УстановитьПараметр("Здание"				, МассивЗадний);
	Запрос.УстановитьПараметр("Улица"				, МассивУлиц);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Если Выборка.СтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено 
		//	ИЛИ Выборка.СтатусПисьма = НовыйСтатусПисьма Тогда
		//	Продолжить;
		//КонецЕсли; 
		
		ПисьмоОбъект = Выборка.ЭлектронноеПисьмо.ПолучитьОбъект();
		
		Если НовыйСтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее Тогда
			
			ПисьмоОбъект.СтатусПисьма           = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
			
		ИначеЕсли НовыйСтатусПисьма = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено Тогда
			
			Если ЗначениеЗаполнено(Выборка.СписокПолучателейПисьма) Тогда
				Профиль =  РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			Иначе
				Продолжить;
			КонецЕсли;
			
			Попытка
				Соединение = Новый ИнтернетПочта;
				Соединение.Подключиться(Профиль);
			Исключение
				
				ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка
				|%2'"), УчетнаяЗапись, ?(ИнформацияОбОшибке().Причина = Неопределено, "", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке().Причина)));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
				
				Продолжить;
				
			КонецПопытки;
			
			Попытка
				
				Если НЕ ЗначениеЗаполнено(ПисьмоОбъект.УчетнаяЗапись) Тогда
					ПисьмоОбъект.УчетнаяЗапись = УчетнаяЗапись; 
				КонецЕсли;
				
				ИдентификаторПисьма = бит_УправлениеЭлектроннойПочтойСервер.ВыполнитьОтправкуПисьма(ПисьмоОбъект, Соединение);
			Исключение
				
				ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Во время отправки электронного письма %1 произошла ошибка
				|%2'"), Выборка.ЭлектронноеПисьмо, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
				
				Продолжить;
				
			КонецПопытки;
			
			ПисьмоОбъект.ИдентификаторСообщения = ИдентификаторПисьма;
			ПисьмоОбъект.СтатусПисьма           = Перечисления.бит_СтатусыИсходящегоЭлектронногоПисьма.Отправлено;
			ПисьмоОбъект.Размер                 = бит_УправлениеЭлектроннойПочтойСервер.ОценитьРазмерИсходящегоЭлектронногоПисьма(ПисьмоОбъект.Ссылка);
			ПисьмоОбъект.ДатаОтправления        = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
		ПисьмоОбъект.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПрикрепленныйФайл(ТабДок, ИмяФайла, ТипФайла)
	
	ПутьВоВременномХранилище = "";
	
	ЗаписьZipФайла = Неопределено;
	ИмяАрхива      = Неопределено;
	Если ЗапаковатьZIP Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	ИмяФайла = ИмяФайла + "." + НРег(Строка(ТипФайла));
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	
	ИмяВременногоФайла = ИмяВременнойПапки + "\" + ИмяФайла;
	ТабДок.Записать(ИмяВременногоФайла, ТипФайла);
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
		ВставитьКартинкиВHTML(ИмяВременногоФайла);
	КонецЕсли;
	
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Добавить(ИмяВременногоФайла);
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ПутьВоВременномХранилище;
	
КонецФункции

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок   = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// Ожидается, что в папке будут только картинки.
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

#КонецОбласти
